{
  "surf dog names": {
    "title": "Top 10 Surf Dog Names: Cool & Catchy Waves",
    "description": "Find the perfect name for your beach-loving pup! Explore our list of 10 cool and catchy surf dog names, inspired by the ocean and surfing culture."
  },
  "blue dog names": {
    "title": "Ultimate List of 50+ Blue Dog Names: Stunning & Unique",
    "description": "Looking for a unique name for your blue-coated dog? Discover a collection of 50+ beautiful and meaningful blue dog names that perfectly suit their stunning appearance."
  },
  "dutch dog names": {
    "title": "25+ Best Dutch Dog Names: Authentic & Meaningful", 
    "description": "Celebrate your Dutch heritage with a unique and meaningful Dutch dog name. Explore our list of 25+ traditional and modern options for your beloved canine companion." 
  },
 "country dog names": {
    "title": "30+ Best Country Dog Names: Rustic & Charming",
    "description": "Find the perfect country-inspired name for your dog! Explore our list of 30+ rustic, charming, and down-to-earth names that capture the spirit of the countryside."
  },
  "spiritual dog names": {
    "title": "Top 20 Spiritual Dog Names: Divine & Meaningful",
    "description": "Give your dog a name that reflects your spiritual connection. Discover a list of 20 meaningful and inspiring spiritual dog names, from ancient deities to peaceful virtues."
  },
  "jeep dog names": {
    "title": "15 Ultimate Jeep Dog Names: Tough & Adventurous",
    "description": "For the ultimate off-road companion! Find the perfect Jeep-inspired name for your adventurous dog. Explore our list of 15 tough, rugged, and trail-ready names."
  },
  "redneck dog names": {
    "title": "25 Hilarious Redneck Dog Names: Funny & Quirky",
    "description": "Embrace your inner redneck with a hilariously unique dog name! Explore our list of 25 funny and quirky redneck dog names for your southern-style pup."
  },
  "fluffy dog names": {
    "title": "50+ Adorable Fluffy Dog Names: Soft & Sweet",
    "description": "Find the perfect name for your cloud-like canine! Explore our list of 50+ adorable and fluffy dog names that perfectly suit their soft and cuddly appearance."
  },
  "hippie dog names": {
    "title": "20 Groovy Hippie Dog Names: Peaceful & Free-Spirited",
    "description": "Give your dog a name that reflects your free-spirited personality! Explore our list of 20 peaceful and groovy hippie dog names for your beloved canine companion."
  },
  "hipster dog names": {
    "title": "10 Unique Hipster Dog Names: Cool & Ironic",
    "description": "Find the perfect name for your trendy pup! Explore our list of 10 cool, unique, and slightly ironic hipster dog names that will turn heads."
  }
}
